In [1]:
import numpy as np
import pandas as pd

In [2]:
# Creating a dictionary of and converting into a dataframe(Tabular form) with pandas
dict1 = {'Name': ['Priyang', 'Aadhya', 'Krisha', 'Vedant', 'Parshv', 'Mittal', 'Archana'],
         'Marks': [98, 89, 99, 87, 90, 83, 99],
         'Gender': ['Male', 'Female', 'Female', 'Male', 'Male', 'Female', 'Female']
         }
df1 = pd.DataFrame(dict1)

In [3]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [4]:
# Displaying the first 5 rows
df1.head()

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male

In [5]:
# Displaying the desired number of rows
# Displaying top 3 rows
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [6]:
# Displaying last 5 rows
df1.tail() # default is 5 rows

      Name  Marks  Gender
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [7]:
# Displaying last 3 rows
df1.tail(3) # 3 rows

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [8]:
# Finding number of rows and columns
df1.shape

(7, 3)

In [9]:
print("Number of rows: ", df1.shape[0])
print("Number of columns: ", df1.shape[1])

Number of rows:  7
Number of columns:  3

In [10]:
# Displaying the information about the dataframe
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [11]:
# Displaying the null values in the dataset
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [12]:
# Displaying the null values in the dataset according to the columns
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [13]:
# Displaying the null values in the dataset according to the rows
df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [14]:
# Getting overall statistics of the dataset
df1.describe() # default is numeric

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [15]:
# Displaying the statistics of the dataset according to the columns and rows
df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [16]:
df1.mean(numeric_only=True)

Marks    92.142857
dtype: float64

In [17]:
# Finding the minimum value in the dataset
df1.min()

Name      Aadhya
Marks         83
Gender    Female
dtype: object

In [18]:
# Finding unique values in the Gender column
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [19]:
# Displaying number of unique values in Gender column
df1['Gender'].nunique()

2

In [20]:
# Displaying count of unique values in Gender column (That is displaying the number of times unique value is present in the column)
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

In [21]:
# Finding total number of students having marks betweem 90 and 100
df1['Marks'] >= 90

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [22]:
# Finding total number of students having marks betweem 90 and 100
df1[df1['Marks'] >= 90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [24]:
df1[(df1['Marks'] >= 90) & (df1['Marks'] <= 100)].shape

(4, 3)

In [25]:
df1[(df1['Marks'] >= 90) & (df1['Marks'] <= 100)].shape[0] # displaying the number of rows

4

In [26]:
df1[(df1['Marks'] >= 90) & (df1['Marks'] <= 100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [27]:
len(df1[(df1['Marks'] >= 90) & (df1['Marks'] <= 100)])

4

In [28]:
# Using between function to find the number of students having marks between 90 and 100
df1['Marks'].between(90, 100) # Both are inclusive

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [29]:
df1[df1['Marks'].between(90, 100)]  # Both are inclusive

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [30]:
# Finding average marks
df1['Marks'].mean()

92.14285714285714